#include <stdio.h>
#include <unistd.h>
#ifdef PTHREADS
#include <pthread.h>
#endif
#ifdef MPI
#include <signal.h>
#include <mpi.h>
#include "auto_mpi.h"
#endif
#include <string.h>
#include <float.h>
#include <math.h>

#ifndef __AUTO_C_H__
#define __AUTO_C_H__

#define Inf     DBL_MAX

#define NPARX (150) /* allows for 110 parameters */
#define NBIFX (20)
#define KREDO (1)  /*get rid of*/
#define NPARX2 (NPARX*2)  /*get rid of*/
#define HMACH (1.0e-7)
#define RSMALL (1.0e-30)
#define RLARGE (1.0e+30)
#define HMACH1 (HMACH+1.0e0)
#define M1SB (NBIFX) 
#define LEFT (1)
#define RIGHT (2)
#define QZMATZ (.FALSE.)
#define QZEPS1 (0.0E0)
#define HMACHHO (1.0e-13)

extern FILE *fp2;
extern FILE *fp9;
extern FILE *fp10;
extern FILE *fp12;

#define CONPAR_DEFAULT  0
#define CONPAR_PTHREADS 1
#define CONPAR_MPI      2
#define SETUBV_DEFAULT  0
#define SETUBV_PTHREADS 1
#define SETUBV_MPI      2
#define REDUCE_DEFAULT  0
#define REDUCE_PTHREADS 1
#define REDUCE_MPI      2

extern int global_conpar_type;
extern int global_setubv_type;
extern int global_reduce_type;
extern int global_num_procs;
extern int global_verbose_flag;

typedef struct {
  /* 1 */ integer ndim;
  /* 2 */ integer ips;
  /* 3 */ integer irs;
  /* 4 */ integer ilp;
  /* 5 */ integer ntst;
  /* 6 */ integer ncol;
  /* 7 */ integer iad;
  /* 8 */ integer iads;
  /* 9 */ integer isp;
  /* 10 */ integer isw;
  /* 11 */ integer iplt;
  /* 12 */ integer nbc;
  /* 13 */ integer nint;
#ifdef MANIFOLD
  /* 13a*/ integer nalc;    /* The number of arclength constraints (k) */
#endif
  /* 14 */ integer nmx;
  /* 15 */ integer nuzr;
  /* 16 */ integer npr;
  /* 17 */ integer mxbf;
  /* 18 */ integer iid;
  /* 19 */ integer itmx;
  /* 20 */ integer itnw;
  /* 21 */ integer nwtn;
  /* 22 */ integer jac;
  /* 23 */ integer ndm;
  /* 24 */ integer nbc0;
  /* 25 */ integer nnt0;
  /* 26 */ integer iuzr;
  /* 27 */ integer itp;
  /* 28 */ integer itpst;
  /* 29 */ integer nfpr;
  /* 30 */ integer ibr;
  /* 31 */ integer nit;
  /* 32 */ integer ntot;
  /* 33 */ integer nins;
  /* 34 */ integer istop;
  /* 35 */ integer nbif;
  /* 36 */ integer ipos;
  /* 37 */ integer lab;
  /* 41 */ integer nicp;
  /* The following are not set in init_.  
     They have to do with the old parallel version. */
  /* 38 */ integer mynode;
  /* 39 */ integer numnodes;
  /* 40 */ integer parallel_flag;
} iap_type;

typedef struct {
  /* 1 */ doublereal ds;
  /* 2 */ doublereal dsmin;
  /* 3 */ doublereal dsmax;
  /* There is no 4 */
  /* 5 */ doublereal dsold;
  /* 6 */ doublereal rl0;
  /* 7 */ doublereal rl1;
  /* 8 */ doublereal a0;
  /* 9 */ doublereal a1;
  /* 10 */ doublereal amp;
  /* 11 */ doublereal epsl;
  /* 12 */ doublereal epsu;
  /* 13 */ doublereal epss;
  /* 14 */ doublereal det;
  /* 15 */ doublereal tivp;
  /* 16 */ doublereal fldf;
  /* 17 */ doublereal hbff;
  /* 18 */ doublereal biff;
  /* 19 */ doublereal spbf;
} rap_type;

typedef struct {
    integer ibr;    // The index of the branch.
    integer mtot;   // The index of the point (modulo 10000).
    integer itp;    // The type of point.
    integer lab;    // The label of the point.
    integer nfpr;   // The number of free parameters used in the computation.
    integer isw;    // The value of ISW used in the computation.
    integer ntpl;   // The number of points in the time interval [0,1] for which solution values are written.
    integer nar;    // The number of values written per point. (NAR=NDIM+1, since T and U(i), i=1,..,NDIM are written).
    integer nrowpr; // AUTO specific output formatting parameter (not really needed).  Included for completion.
    integer ntst;   // The number of time intervals used in the discretization.
    integer ncol;   // The number of collocation points used.
    integer nparx;  // The dimension of the par array (and the number of values in the parameter block).
